main.floors.MT1=
{
"floorId": "MT1",
"title": "迷境 0-",
"name": "0-",
"canFlyTo": true,
"canUseQuickShop": true,
"defaultGround": "ground",
"png": [],
"bgm": "bgm.mp3",
"map": [
    [  0,  0,153,153,153,  0,  0,  0,  0,  0,153,153,  0],
    [  0,  0,153,153,153,  0, 89,  0,153,  0,  0,153,  0],
    [  0,  0,  0,  0,  0,153,  0,153,153,  0,  0,153,  0],
    [153,153,153,153,  0,153,  0,  0,153,153,  0,153,  0],
    [153,  0,  0,153,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [153,  0,  0,153,  0,153,153,153,  0,  0,153,153,153],
    [153, 89,203,203,  0,153,  0,  0,153,  0,153, 89,  0],
    [153,153,153,  0,  0,  0,  0,  0,153,  0,153,  0,  0],
    [153,  0, 27,201,153,153,153,153,153,201,153,153,  0],
    [153,  0,153,  0,  0,  0,  0,  0,201,  0,153,  0,  0],
    [153,  0,153,  0,  0,153,129,  0,153,  0,153,  0,  0],
    [  0,  0,153,  0,  0,153,  0,  0,153,  0,153,153,  0],
    [  0,  0,  0,  0,153,153,  0,  0,153,  0,  0,  0,  0]
],
"firstArrive": [],
"events": {
    "6,1": [
        {
            "type": "function",
            "function": "function(){\nvar _id='mt14_1';teleport('mt14',4);\n}"
        }
    ],
    "11,6": [
        {
            "type": "function",
            "function": "function(){\nvar _id='mt15_1';teleport('mt15',5);\n}"
        }
    ],
    "1,6": [
        {
            "type": "function",
            "function": "function(){\nvar _id='mt13_1';teleport('mt13',3);\n}"
        }
    ],
    "6,10": [
        "在每次战斗后,地图1格外的方块会沿着战斗进行的方向飘移一格",
        "状态数字显示的分别是破墙镐,炸弹和中心对称飞行器的数量,对应快捷键分别是1,2,3"
    ]
},
"changeFloor": {},
"afterBattle": {},
"afterGetItem": {},
"afterOpenDoor": {},
"cannotMove": {},
}